// //.title
// // ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
// //
// // 🇽🇾🇿 & Dev
// //
// // Licencing details are in the LICENSE file in the root directory.
// //
// // ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
// //.title~

// import '/xyz_gen_annotations.dart';

// // ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░

// abstract class ModelWithRef extends Model {
//   //
//   //
//   //

//   /// The unique identifier of the model.
//   String? get id => ref?.id;

//   /// The key for the unique reference to the model.
//   static const K_REF = 'ref';

//   /// The unique reference to the model.
//   DataRefModel? get ref => null;

//   //
//   //
//   //

//   const ModelWithRef();

//   //
//   //
//   //

 
// }

// // ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░

// /// A class that extends [ModelWithRef] and provides a reference to itself.
// abstract class ThisModelWithRef<T extends ModelWithRef> extends ModelWithRef {
//   T get model => this as T;
//   const ThisModelWithRef();
// }
